INSA-GEI/arm-ada/lib/arm/embedded-stm32f746disco-armada/bsp/BSP/Components/lsm6ds3/lsm6ds3_reg.h
/*
 ******************************************************************************
 * @file    lsm6ds3_reg.h
 * @author  Sensors Software Solution Team
 * @brief   This file contains all the functions prototypes for the
 *          lsm6ds3_reg.c driver.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2019 STMicroelectronics</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright
 *      notice, this list of conditions and the following disclaimer in the
 *      documentation and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its
 *      contributors may be used to endorse or promote products derived from
 *      this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 */
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef LSM6DS3_REGS_H
#define LSM6DS3_REGS_H

#ifdef __cplusplus
  extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include <stdint.h>
#include <math.h>

/** @addtogroup LSM6DS3
  * @{
  *
  */

/** @defgroup LSM6DS3_sensors_common_types
  * @{
  *
  */

#ifndef MEMS_SHARED_TYPES
#define MEMS_SHARED_TYPES

/**
  * @defgroup axisXbitXX_t
  * @brief    These unions are useful to represent different sensors data type.
  *           These unions are not need by the driver.
  *
  *           REMOVING the unions you are compliant with:
  *           MISRA-C 2012 [Rule 19.2] -> " Union are not allowed "
  *
  * @{
  *
  */

typedef union{
  int16_t i16bit[3];
  uint8_t u8bit[6];
} axis3bit16_t;

typedef union{
  int16_t i16bit;
  uint8_t u8bit[2];
} axis1bit16_t;

typedef union{
  int32_t i32bit[3];
  uint8_t u8bit[12];
} axis3bit32_t;

typedef union{
  int32_t i32bit;
  uint8_t u8bit[4];
} axis1bit32_t;

/**
  * @}
  *
  */

typedef struct{
  uint8_t bit0       : 1;
  uint8_t bit1       : 1;
  uint8_t bit2       : 1;
  uint8_t bit3       : 1;
  uint8_t bit4       : 1;
  uint8_t bit5       : 1;
  uint8_t bit6       : 1;
  uint8_t bit7       : 1;
} bitwise_t;

#define PROPERTY_DISABLE                (0U)
#define PROPERTY_ENABLE                 (1U)

#endif /* MEMS_SHARED_TYPES */

/**
  * @}
  *
  */

/** @addtogroup  LSM6DS3_Interfaces_Functions
  * @brief       This section provide a set of functions used to read and
  *              write a generic register of the device.
  *              MANDATORY: return 0 -> no Error.
  * @{
  *
  */

typedef int32_t (*lsm6ds3_write_ptr)(void *, uint8_t, uint8_t*, uint16_t);
typedef int32_t (*lsm6ds3_read_ptr) (void *, uint8_t, uint8_t*, uint16_t);

typedef struct {
  /** Component mandatory fields **/
  lsm6ds3_write_ptr  write_reg;
  lsm6ds3_read_ptr   read_reg;
  /** Customizable optional pointer **/
  void *handle;
} lsm6ds3_ctx_t;

/**
  * @}
  *
  */

/** @defgroup LSM6DS3_Infos
  * @{
  *
  */

/** I2C Device Address 8 bit format  if SA0=0 -> 0xD5 if SA0=1 -> 0xD7 **/
#define LSM6DS3_I2C_ADD_L                          0xD5U
#define LSM6DS3_I2C_ADD_H                          0xD7U
/** Device Identification (Who am I) **/
#define LSM6DS3_ID                                 0x69U
#define LSM6DS3TR_C_ID                             0x6AU

/**
  * @}
  *
  */

#define LSM6DS3_FUNC_CFG_ACCESS                    0x01U
typedef struct {
  uint8_t not_used_01                 : 7;
  uint8_t func_cfg_en                 : 1;
} lsm6ds3_func_cfg_access_t;

#define LSM6DS3_SENSOR_SYNC_TIME_FRAME             0x04U
typedef struct {
  uint8_t tph                         : 8;
} lsm6ds3_sensor_sync_time_frame_t;

#define LSM6DS3_FIFO_CTRL1                         0x06U
typedef struct {
  uint8_t fth                         : 8;
} lsm6ds3_fifo_ctrl1_t;

#define LSM6DS3_FIFO_CTRL2                         0x07U
typedef struct {
  uint8_t fth                         : 4;
  uint8_t not_used_01                 : 2;
  uint8_t  timer_pedo_fifo_drdy       : 1;
  uint8_t timer_pedo_fifo_en          : 1;
} lsm6ds3_fifo_ctrl2_t;

#define LSM6DS3_FIFO_CTRL3                         0x08U
typedef struct {
  uint8_t dec_fifo_xl                 : 3;
  uint8_t dec_fifo_gyro               : 3;
  uint8_t not_used_01                 : 2;
} lsm6ds3_fifo_ctrl3_t;

#define LSM6DS3_FIFO_CTRL4                         0x09U
typedef struct {
  uint8_t dec_ds3_fifo                : 3;
  uint8_t dec_ds4_fifo                : 3;
  uint8_t only_high_data              : 1;
  uint8_t not_used_01                 : 1;
} lsm6ds3_fifo_ctrl4_t;

#define LSM6DS3_FIFO_CTRL5                         0x0AU
typedef struct {
  uint8_t fifo_mode                   : 3;
  uint8_t odr_fifo                    : 4;
  uint8_t not_used_01                 : 1;
} lsm6ds3_fifo_ctrl5_t;

#define LSM6DS3_ORIENT_CFG_G                       0x0BU
typedef struct {
  uint8_t orient                      : 3;
  uint8_t sign_g                      : 3;  /* SignX_G) + SignY_G + SignZ_G */
  uint8_t not_used_01                 : 2;
} lsm6ds3_orient_cfg_g_t;

