INSA-GEI/arm-ada/lib/arm/embedded-stm32f746disco-armada/bsp/BSP/Components/lsm6ds3/lsm6ds3_reg.h
#define LSM6DS3_INT1_CTRL                          0x0DU
typedef struct {
  uint8_t int1_drdy_xl                : 1;
  uint8_t int1_drdy_g                 : 1;
  uint8_t int1_boot                   : 1;
  uint8_t int1_fth                    : 1;
  uint8_t int1_fifo_ovr               : 1;
  uint8_t int1_full_flag              : 1;
  uint8_t int1_sign_mot               : 1;
  uint8_t int1_step_detector          : 1;
} lsm6ds3_int1_ctrl_t;

#define LSM6DS3_INT2_CTRL                          0x0EU
typedef struct {
  uint8_t int2_drdy_xl                : 1;
  uint8_t int2_drdy_g                 : 1;
  uint8_t int2_drdy_temp              : 1;
  uint8_t int2_fth                    : 1;
  uint8_t int2_fifo_ovr               : 1;
  uint8_t int2_full_flag              : 1;
  uint8_t int2_step_count_ov          : 1;
  uint8_t int2_step_delta             : 1;
} lsm6ds3_int2_ctrl_t;

#define LSM6DS3_WHO_AM_I                           0x0FU
#define LSM6DS3_CTRL1_XL                           0x10U
typedef struct {
  uint8_t bw_xl                       : 2;
  uint8_t fs_xl                       : 2;
  uint8_t odr_xl                      : 4;
} lsm6ds3_ctrl1_xl_t;

#define LSM6DS3_CTRL2_G                            0x11U
typedef struct {
  uint8_t not_used_01                 : 1;
  uint8_t fs_g                        : 3;    /* FS_G + FS_125 */
  uint8_t odr_g                       : 4;
} lsm6ds3_ctrl2_g_t;

#define LSM6DS3_CTRL3_C                            0x12U
typedef struct {
  uint8_t sw_reset                    : 1;
  uint8_t ble                         : 1;
  uint8_t if_inc                      : 1;
  uint8_t sim                         : 1;
  uint8_t pp_od                       : 1;
  uint8_t h_lactive                   : 1;
  uint8_t bdu                         : 1;
  uint8_t boot                        : 1;
} lsm6ds3_ctrl3_c_t;

#define LSM6DS3_CTRL4_C                            0x13U
typedef struct {
  uint8_t stop_on_fth                 : 1;
  uint8_t not_used_01                 : 1;
  uint8_t i2c_disable                 : 1;
  uint8_t drdy_mask                   : 1;
  uint8_t fifo_temp_en                : 1;
  uint8_t int2_on_int1                : 1;
  uint8_t sleep_g                     : 1;
  uint8_t xl_bw_scal_odr              : 1;
} lsm6ds3_ctrl4_c_t;

#define LSM6DS3_CTRL5_C                            0x14U
typedef struct {
  uint8_t st_xl                       : 2;
  uint8_t st_g                        : 2;
  uint8_t not_used_01                 : 1;
  uint8_t rounding                    : 3;
} lsm6ds3_ctrl5_c_t;

#define LSM6DS3_CTRL6_C                            0x15U
typedef struct {
  uint8_t not_used_01                 : 4;
  uint8_t xl_hm_mode                  : 1;
  uint8_t den_mode                    : 3;  /* trig_en + lvl1_en + lvl2_en */
} lsm6ds3_ctrl6_c_t;

#define LSM6DS3_CTRL7_G                            0x16U
typedef struct {
  uint8_t not_used_01                 : 2;
  uint8_t rounding_status             : 1;
  uint8_t hpcf_g                      : 2;
  uint8_t hp_g_rst                    : 1;
  uint8_t hp_g_en                     : 1;
  uint8_t g_hm_mode                   : 1;
} lsm6ds3_ctrl7_g_t;

#define LSM6DS3_CTRL8_XL                           0x17U
typedef struct {
  uint8_t low_pass_on_6d              : 1;
  uint8_t not_used_01                 : 1;
  uint8_t hp_slope_xl_en              : 1;
  uint8_t not_used_02                 : 2;
  uint8_t hpcf_xl                     : 2;
  uint8_t lpf2_xl_en                  : 1;
} lsm6ds3_ctrl8_xl_t;

#define LSM6DS3_CTRL9_XL                           0x18U
typedef struct {
  uint8_t not_used_01                 : 2;
  uint8_t soft_en                     : 1;
  uint8_t xen_xl                      : 1;
  uint8_t yen_xl                      : 1;
  uint8_t zen_xl                      : 1;
  uint8_t not_used_02                 : 2;
} lsm6ds3_ctrl9_xl_t;

#define LSM6DS3_CTRL10_C                           0x19U
typedef struct {
  uint8_t sign_motion_en              : 1;
  uint8_t pedo_rst_step               : 1;
  uint8_t func_en                     : 1;
  uint8_t xen_g                       : 1;
  uint8_t yen_g                       : 1;
  uint8_t zen_g                       : 1;
  uint8_t not_used_01                 : 2;
} lsm6ds3_ctrl10_c_t;

#define LSM6DS3_MASTER_CONFIG                      0x1AU
typedef struct {
  uint8_t master_on                   : 1;
  uint8_t iron_en                     : 1;
  uint8_t pass_through_mode           : 1;
  uint8_t pull_up_en                  : 1;
  uint8_t start_config                : 1;
  uint8_t not_used_01                 : 1;
  uint8_t data_valid_sel_fifo         : 1;
  uint8_t drdy_on_int1                : 1;
} lsm6ds3_master_config_t;

#define LSM6DS3_WAKE_UP_SRC                        0x1BU
typedef struct {
  uint8_t z_wu                        : 1;
  uint8_t y_wu                        : 1;
  uint8_t x_wu                        : 1;
  uint8_t wu_ia                       : 1;
  uint8_t sleep_state_ia              : 1;
  uint8_t ff_ia                       : 1;
  uint8_t not_used_01                 : 2;
} lsm6ds3_wake_up_src_t;

#define LSM6DS3_TAP_SRC                            0x1CU
typedef struct {
  uint8_t z_tap                       : 1;
  uint8_t y_tap                       : 1;
  uint8_t x_tap                       : 1;
  uint8_t tap_sign                    : 1;
  uint8_t double_tap                  : 1;
  uint8_t single_tap                  : 1;
  uint8_t tap_ia                      : 1;
  uint8_t not_used_01                 : 1;
} lsm6ds3_tap_src_t;

#define LSM6DS3_D6D_SRC                            0x1DU
typedef struct {
  uint8_t xl                          : 1;
  uint8_t xh                          : 1;
  uint8_t yl                          : 1;
  uint8_t yh                          : 1;
  uint8_t zl                          : 1;
  uint8_t zh                          : 1;
  uint8_t d6d_ia                      : 1;
  uint8_t not_used_01                 : 1;
} lsm6ds3_d6d_src_t;

#define LSM6DS3_STATUS_REG                         0x1EU
typedef struct {
  uint8_t xlda                        : 1;
  uint8_t gda                         : 1;
  uint8_t tda                         : 1;
  uint8_t not_used_01                 : 5;
} lsm6ds3_status_reg_t;

#define LSM6DS3_OUT_TEMP_L                         0x20U
#define LSM6DS3_OUT_TEMP_H                         0x21U
#define LSM6DS3_OUTX_L_G                           0x22U
#define LSM6DS3_OUTX_H_G                           0x23U
#define LSM6DS3_OUTY_L_G                           0x24U
#define LSM6DS3_OUTY_H_G                           0x25U
#define LSM6DS3_OUTZ_L_G                           0x26U
#define LSM6DS3_OUTZ_H_G                           0x27U
#define LSM6DS3_OUTX_L_XL                          0x28U
#define LSM6DS3_OUTX_H_XL                          0x29U
#define LSM6DS3_OUTY_L_XL                          0x2AU
#define LSM6DS3_OUTY_H_XL                          0x2BU
#define LSM6DS3_OUTZ_L_XL                          0x2CU
#define LSM6DS3_OUTZ_H_XL                          0x2DU
#define LSM6DS3_SENSORHUB1_REG                     0x2EU
typedef struct {
  uint8_t shub1_0                     : 1;
  uint8_t shub1_1                     : 1;
  uint8_t shub1_2                     : 1;
  uint8_t shub1_3                     : 1;
  uint8_t shub1_4                     : 1;
  uint8_t shub1_5                     : 1;
  uint8_t shub1_6                     : 1;
  uint8_t shub1_7                     : 1;
} lsm6ds3_sensorhub1_reg_t;

#define LSM6DS3_SENSORHUB2_REG                     0x2FU
typedef struct {
  uint8_t shub2_0                     : 1;
  uint8_t shub2_1                     : 1;
  uint8_t shub2_2                     : 1;
  uint8_t shub2_3                     : 1;
  uint8_t shub2_4                     : 1;
  uint8_t shub2_5                     : 1;
  uint8_t shub2_6                     : 1;
  uint8_t shub2_7                     : 1;
} lsm6ds3_sensorhub2_reg_t;

