INSA-GEI/arm-ada/lib/arm/embedded-stm32f746disco-armada/bsp/BSP/Components/lsm6ds3/lsm6ds3_reg.h
#define LSM6DS3_SENSORHUB3_REG                     0x30U
typedef struct {
  uint8_t shub3_0                     : 1;
  uint8_t shub3_1                     : 1;
  uint8_t shub3_2                     : 1;
  uint8_t shub3_3                     : 1;
  uint8_t shub3_4                     : 1;
  uint8_t shub3_5                     : 1;
  uint8_t shub3_6                     : 1;
  uint8_t shub3_7                     : 1;
} lsm6ds3_sensorhub3_reg_t;

#define LSM6DS3_SENSORHUB4_REG                     0x31U
typedef struct {
  uint8_t shub4_0                     : 1;
  uint8_t shub4_1                     : 1;
  uint8_t shub4_2                     : 1;
  uint8_t shub4_3                     : 1;
  uint8_t shub4_4                     : 1;
  uint8_t shub4_5                     : 1;
  uint8_t shub4_6                     : 1;
  uint8_t shub4_7                     : 1;
} lsm6ds3_sensorhub4_reg_t;

#define LSM6DS3_SENSORHUB5_REG                     0x32U
typedef struct {
  uint8_t shub5_0                     : 1;
  uint8_t shub5_1                     : 1;
  uint8_t shub5_2                     : 1;
  uint8_t shub5_3                     : 1;
  uint8_t shub5_4                     : 1;
  uint8_t shub5_5                     : 1;
  uint8_t shub5_6                     : 1;
  uint8_t shub5_7                     : 1;
} lsm6ds3_sensorhub5_reg_t;

#define LSM6DS3_SENSORHUB6_REG                     0x33U
typedef struct {
  uint8_t shub6_0                     : 1;
  uint8_t shub6_1                     : 1;
  uint8_t shub6_2                     : 1;
  uint8_t shub6_3                     : 1;
  uint8_t shub6_4                     : 1;
  uint8_t shub6_5                     : 1;
  uint8_t shub6_6                     : 1;
  uint8_t shub6_7                     : 1;
} lsm6ds3_sensorhub6_reg_t;

#define LSM6DS3_SENSORHUB7_REG                     0x34U
typedef struct {
  uint8_t shub7_0                     : 1;
  uint8_t shub7_1                     : 1;
  uint8_t shub7_2                     : 1;
  uint8_t shub7_3                     : 1;
  uint8_t shub7_4                     : 1;
  uint8_t shub7_5                     : 1;
  uint8_t shub7_6                     : 1;
  uint8_t shub7_7                     : 1;
} lsm6ds3_sensorhub7_reg_t;

#define LSM6DS3_SENSORHUB8_REG                     0x35U
typedef struct {
  uint8_t shub8_0                     : 1;
  uint8_t shub8_1                     : 1;
  uint8_t shub8_2                     : 1;
  uint8_t shub8_3                     : 1;
  uint8_t shub8_4                     : 1;
  uint8_t shub8_5                     : 1;
  uint8_t shub8_6                     : 1;
  uint8_t shub8_7                     : 1;
} lsm6ds3_sensorhub8_reg_t;

#define LSM6DS3_SENSORHUB9_REG                     0x36U
typedef struct {
  uint8_t shub9_0                     : 1;
  uint8_t shub9_1                     : 1;
  uint8_t shub9_2                     : 1;
  uint8_t shub9_3                     : 1;
  uint8_t shub9_4                     : 1;
  uint8_t shub9_5                     : 1;
  uint8_t shub9_6                     : 1;
  uint8_t shub9_7                     : 1;
} lsm6ds3_sensorhub9_reg_t;

#define LSM6DS3_SENSORHUB10_REG                    0x37U
typedef struct {
  uint8_t shub10_0                    : 1;
  uint8_t shub10_1                    : 1;
  uint8_t shub10_2                    : 1;
  uint8_t shub10_3                    : 1;
  uint8_t shub10_4                    : 1;
  uint8_t shub10_5                    : 1;
  uint8_t shub10_6                    : 1;
  uint8_t shub10_7                    : 1;
} lsm6ds3_sensorhub10_reg_t;

#define LSM6DS3_SENSORHUB11_REG                    0x38U
typedef struct {
  uint8_t shub11_0                    : 1;
  uint8_t shub11_1                    : 1;
  uint8_t shub11_2                    : 1;
  uint8_t shub11_3                    : 1;
  uint8_t shub11_4                    : 1;
  uint8_t shub11_5                    : 1;
  uint8_t shub11_6                    : 1;
  uint8_t shub11_7                    : 1;
} lsm6ds3_sensorhub11_reg_t;

#define LSM6DS3_SENSORHUB12_REG                    0x39U
typedef struct {
  uint8_t shub12_0                    : 1;
  uint8_t shub12_1                    : 1;
  uint8_t shub12_2                    : 1;
  uint8_t shub12_3                    : 1;
  uint8_t shub12_4                    : 1;
  uint8_t shub12_5                    : 1;
  uint8_t shub12_6                    : 1;
  uint8_t shub12_7                    : 1;
} lsm6ds3_sensorhub12_reg_t;

#define LSM6DS3_FIFO_STATUS1                       0x3AU
typedef struct {
  uint8_t diff_fifo                   : 8;
} lsm6ds3_fifo_status1_t;

#define LSM6DS3_FIFO_STATUS2                       0x3BU
typedef struct {
  uint8_t diff_fifo                   : 4;
  uint8_t fifo_empty                  : 1;
  uint8_t fifo_full                   : 1;
  uint8_t fifo_over_run               : 1;
  uint8_t fth                         : 1;
} lsm6ds3_fifo_status2_t;

#define LSM6DS3_FIFO_STATUS3                        0x3CU
typedef struct {
  uint8_t fifo_pattern                : 8;
} lsm6ds3_fifo_status3_t;

#define LSM6DS3_FIFO_STATUS4                       0x3DU
typedef struct {
  uint8_t fifo_pattern                : 2;
  uint8_t not_used_01                 : 6;
} lsm6ds3_fifo_status4_t;

#define LSM6DS3_FIFO_DATA_OUT_L                    0x3EU
#define LSM6DS3_FIFO_DATA_OUT_H                    0x3FU
#define LSM6DS3_TIMESTAMP0_REG                     0x40U
#define LSM6DS3_TIMESTAMP1_REG                     0x41U
#define LSM6DS3_TIMESTAMP2_REG                     0x42U
#define LSM6DS3_STEP_TIMESTAMP_L                   0x49U
#define LSM6DS3_STEP_TIMESTAMP_H                   0x4AU
#define LSM6DS3_STEP_COUNTER_L                     0x4BU
#define LSM6DS3_STEP_COUNTER_H                     0x4CU
#define LSM6DS3_SENSORHUB13_REG                    0x4DU
typedef struct {
  uint8_t shub13_0                    : 1;
  uint8_t shub13_1                    : 1;
  uint8_t shub13_2                    : 1;
  uint8_t shub13_3                    : 1;
  uint8_t shub13_4                    : 1;
  uint8_t shub13_5                    : 1;
  uint8_t shub13_6                    : 1;
  uint8_t shub13_7                    : 1;
} lsm6ds3_sensorhub13_reg_t;

#define LSM6DS3_SENSORHUB14_REG                    0x4EU
typedef struct {
  uint8_t shub14_0                    : 1;
  uint8_t shub14_1                    : 1;
  uint8_t shub14_2                    : 1;
  uint8_t shub14_3                    : 1;
  uint8_t shub14_4                    : 1;
  uint8_t shub14_5                    : 1;
  uint8_t shub14_6                    : 1;
  uint8_t shub14_7                    : 1;
} lsm6ds3_sensorhub14_reg_t;

#define LSM6DS3_SENSORHUB15_REG                    0x4FU
typedef struct {
  uint8_t shub15_0                    : 1;
  uint8_t shub15_1                    : 1;
  uint8_t shub15_2                    : 1;
  uint8_t shub15_3                    : 1;
  uint8_t shub15_4                    : 1;
  uint8_t shub15_5                    : 1;
  uint8_t shub15_6                    : 1;
  uint8_t shub15_7                    : 1;
} lsm6ds3_sensorhub15_reg_t;

#define LSM6DS3_SENSORHUB16_REG                    0x50U
typedef struct {
  uint8_t shub16_0                    : 1;
  uint8_t shub16_1                    : 1;
  uint8_t shub16_2                    : 1;
  uint8_t shub16_3                    : 1;
  uint8_t shub16_4                    : 1;
  uint8_t shub16_5                    : 1;
  uint8_t shub16_6                    : 1;
  uint8_t shub16_7                    : 1;
} lsm6ds3_sensorhub16_reg_t;

#define LSM6DS3_SENSORHUB17_REG                    0x51U
typedef struct {
  uint8_t shub17_0                    : 1;
  uint8_t shub17_1                    : 1;
  uint8_t shub17_2                    : 1;
  uint8_t shub17_3                    : 1;
  uint8_t shub17_4                    : 1;
  uint8_t shub17_5                    : 1;
  uint8_t shub17_6                    : 1;
  uint8_t shub17_7                    : 1;
} lsm6ds3_sensorhub17_reg_t;

#define LSM6DS3_SENSORHUB18_REG                    0x52U
typedef struct {
  uint8_t shub18_0                    : 1;
  uint8_t shub18_1                    : 1;
  uint8_t shub18_2                    : 1;
  uint8_t shub18_3                    : 1;
  uint8_t shub18_4                    : 1;
  uint8_t shub18_5                    : 1;
  uint8_t shub18_6                    : 1;
  uint8_t shub18_7                    : 1;
} lsm6ds3_sensorhub18_reg_t;

#define LSM6DS3_FUNC_SRC                           0x53U
typedef struct {
  uint8_t sensor_hub_end_op           : 1;
  uint8_t si_end_op                   : 1;
  uint8_t not_used_01                 : 1;
  uint8_t step_overflow               : 1;
  uint8_t step_detected               : 1;
  uint8_t tilt_ia                     : 1;
  uint8_t sign_motion_ia              : 1;
  uint8_t step_count_delta_ia         : 1;
} lsm6ds3_func_src_t;

#define LSM6DS3_TAP_CFG                            0x58U
typedef struct {
  uint8_t lir                         : 1;
  uint8_t tap_z_en                    : 1;
  uint8_t tap_y_en                    : 1;
  uint8_t tap_x_en                    : 1;
  uint8_t slope_fds                   : 1;
  uint8_t tilt_en                     : 1;
  uint8_t pedo_en                     : 1;
  uint8_t timer_en                    : 1;
} lsm6ds3_tap_cfg_t;

#define LSM6DS3_TAP_THS_6D                         0x59U
typedef struct {
  uint8_t tap_ths                     : 5;
  uint8_t sixd_ths                    : 2;
  uint8_t d4d_en                      : 1;
} lsm6ds3_tap_ths_6d_t;

