INSA-GEI/arm-ada/lib/arm/embedded-stm32f746disco-armada/bsp/BSP/Components/lsm6ds3/lsm6ds3_reg.h
extern float_t lsm6ds3_from_fs125dps_to_mdps(int16_t lsb);
extern float_t lsm6ds3_from_fs250dps_to_mdps(int16_t lsb);
extern float_t lsm6ds3_from_fs500dps_to_mdps(int16_t lsb);
extern float_t lsm6ds3_from_fs1000dps_to_mdps(int16_t lsb);
extern float_t lsm6ds3_from_fs2000dps_to_mdps(int16_t lsb);

extern float_t lsm6ds3_from_lsb_to_celsius(int16_t lsb);

typedef enum {
  LSM6DS3_GY_ORIENT_XYZ = 0,
  LSM6DS3_GY_ORIENT_XZY = 1,
  LSM6DS3_GY_ORIENT_YXZ = 2,
  LSM6DS3_GY_ORIENT_YZX = 3,
  LSM6DS3_GY_ORIENT_ZXY = 4,
  LSM6DS3_GY_ORIENT_ZYX = 5,
} lsm6ds3_gy_orient_t;
int32_t lsm6ds3_gy_data_orient_set(lsm6ds3_ctx_t *ctx,
                                   lsm6ds3_gy_orient_t val);
int32_t lsm6ds3_gy_data_orient_get(lsm6ds3_ctx_t *ctx,
                                   lsm6ds3_gy_orient_t *val);

typedef enum {
  LSM6DS3_GY_SIGN_PPP = 0,
  LSM6DS3_GY_SIGN_PPN = 1,
  LSM6DS3_GY_SIGN_PNP = 2,
  LSM6DS3_GY_SIGN_NPP = 4,
  LSM6DS3_GY_SIGN_NNP = 6,
  LSM6DS3_GY_SIGN_NPN = 5,
  LSM6DS3_GY_SIGN_PNN = 3,
  LSM6DS3_GY_SIGN_NNN = 7,
} lsm6ds3_gy_sgn_t;
int32_t lsm6ds3_gy_data_sign_set(lsm6ds3_ctx_t *ctx, lsm6ds3_gy_sgn_t val);
int32_t lsm6ds3_gy_data_sign_get(lsm6ds3_ctx_t *ctx, lsm6ds3_gy_sgn_t *val);

typedef enum {
  LSM6DS3_2g  = 0,
  LSM6DS3_16g = 1,
  LSM6DS3_4g  = 2,
  LSM6DS3_8g  = 3,
} lsm6ds3_xl_fs_t;
int32_t lsm6ds3_xl_full_scale_set(lsm6ds3_ctx_t *ctx, lsm6ds3_xl_fs_t val);
int32_t lsm6ds3_xl_full_scale_get(lsm6ds3_ctx_t *ctx, lsm6ds3_xl_fs_t *val);

typedef enum {
  LSM6DS3_XL_ODR_OFF    = 0,
  LSM6DS3_XL_ODR_12Hz5  = 1,
  LSM6DS3_XL_ODR_26Hz   = 2,
  LSM6DS3_XL_ODR_52Hz   = 3,
  LSM6DS3_XL_ODR_104Hz  = 4,
  LSM6DS3_XL_ODR_208Hz  = 5,
  LSM6DS3_XL_ODR_416Hz  = 6,
  LSM6DS3_XL_ODR_833Hz  = 7,
  LSM6DS3_XL_ODR_1k66Hz = 8,
  LSM6DS3_XL_ODR_3k33Hz = 9,
  LSM6DS3_XL_ODR_6k66Hz = 10,
} lsm6ds3_odr_xl_t;
int32_t lsm6ds3_xl_data_rate_set(lsm6ds3_ctx_t *ctx, lsm6ds3_odr_xl_t val);
int32_t lsm6ds3_xl_data_rate_get(lsm6ds3_ctx_t *ctx, lsm6ds3_odr_xl_t *val);

typedef enum {
  LSM6DS3_250dps   = 0,
  LSM6DS3_125dps   = 1,
  LSM6DS3_500dps   = 2,
  LSM6DS3_1000dps  = 4,
  LSM6DS3_2000dps  = 6,
} lsm6ds3_fs_g_t;
int32_t lsm6ds3_gy_full_scale_set(lsm6ds3_ctx_t *ctx, lsm6ds3_fs_g_t val);
int32_t lsm6ds3_gy_full_scale_get(lsm6ds3_ctx_t *ctx, lsm6ds3_fs_g_t *val);

typedef enum {
  LSM6DS3_GY_ODR_OFF    = 0,
  LSM6DS3_GY_ODR_12Hz5  = 1,
  LSM6DS3_GY_ODR_26Hz   = 2,
  LSM6DS3_GY_ODR_52Hz   = 3,
  LSM6DS3_GY_ODR_104Hz  = 4,
  LSM6DS3_GY_ODR_208Hz  = 5,
  LSM6DS3_GY_ODR_416Hz  = 6,
  LSM6DS3_GY_ODR_833Hz  = 7,
  LSM6DS3_GY_ODR_1k66Hz = 8,
} lsm6ds3_odr_g_t;
int32_t lsm6ds3_gy_data_rate_set(lsm6ds3_ctx_t *ctx, lsm6ds3_odr_g_t val);
int32_t lsm6ds3_gy_data_rate_get(lsm6ds3_ctx_t *ctx, lsm6ds3_odr_g_t *val);

int32_t lsm6ds3_block_data_update_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_block_data_update_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DS3_XL_HIGH_PERFORMANCE = 0,
  LSM6DS3_XL_NORMAL           = 1,
} lsm6ds3_xl_hm_mode_t;
int32_t lsm6ds3_xl_power_mode_set(lsm6ds3_ctx_t *ctx,
                                  lsm6ds3_xl_hm_mode_t val);
int32_t lsm6ds3_xl_power_mode_get(lsm6ds3_ctx_t *ctx,
                                  lsm6ds3_xl_hm_mode_t *val);

typedef enum {
  LSM6DS3_STAT_RND_DISABLE = 0,
  LSM6DS3_STAT_RND_ENABLE  = 1,
} lsm6ds3_rnd_stat_t;
int32_t lsm6ds3_rounding_on_status_set(lsm6ds3_ctx_t *ctx,
                                       lsm6ds3_rnd_stat_t val);
int32_t lsm6ds3_rounding_on_status_get(lsm6ds3_ctx_t *ctx,
                                       lsm6ds3_rnd_stat_t *val);

typedef enum {
  LSM6DS3_GY_HIGH_PERFORMANCE = 0,
  LSM6DS3_GY_NORMAL           = 1,
} lsm6ds3_g_hm_mode_t;
int32_t lsm6ds3_gy_power_mode_set(lsm6ds3_ctx_t *ctx,
                                  lsm6ds3_g_hm_mode_t val);
int32_t lsm6ds3_gy_power_mode_get(lsm6ds3_ctx_t *ctx,
                                  lsm6ds3_g_hm_mode_t *val);

int32_t lsm6ds3_xl_axis_x_data_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_xl_axis_x_data_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_xl_axis_y_data_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_xl_axis_y_data_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_xl_axis_z_data_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_xl_axis_z_data_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_gy_axis_x_data_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_gy_axis_x_data_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_gy_axis_y_data_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_gy_axis_y_data_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_gy_axis_z_data_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_gy_axis_z_data_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

typedef struct {
  lsm6ds3_wake_up_src_t  wake_up_src;
  lsm6ds3_tap_src_t      tap_src;
  lsm6ds3_d6d_src_t      d6d_src;
  lsm6ds3_func_src_t     func_src;
} lsm6ds3_all_src_t;
int32_t lsm6ds3_all_sources_get(lsm6ds3_ctx_t *ctx, lsm6ds3_all_src_t *val);

int32_t lsm6ds3_status_reg_get(lsm6ds3_ctx_t *ctx, lsm6ds3_status_reg_t *val);

int32_t lsm6ds3_xl_flag_data_ready_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_gy_flag_data_ready_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_temp_flag_data_ready_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_timestamp_raw_get(lsm6ds3_ctx_t *ctx, uint8_t *buff);

int32_t lsm6ds3_timestamp_rst_set(lsm6ds3_ctx_t *ctx);

int32_t lsm6ds3_timestamp_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_timestamp_get(lsm6ds3_ctx_t *ctx, uint8_t *val);
typedef enum {
  LSM6DS3_LSB_6ms4 = 0,
  LSM6DS3_LSB_25us = 1,
} lsm6ds3_ts_res_t;
int32_t lsm6ds3_timestamp_res_set(lsm6ds3_ctx_t *ctx, lsm6ds3_ts_res_t val);
int32_t lsm6ds3_timestamp_res_get(lsm6ds3_ctx_t *ctx, lsm6ds3_ts_res_t *val);

typedef enum {
  LSM6DS3_ROUND_DISABLE             = 0,
  LSM6DS3_ROUND_XL                  = 1,
  LSM6DS3_ROUND_GY                  = 2,
  LSM6DS3_ROUND_GY_XL               = 3,
  LSM6DS3_ROUND_SH1_TO_SH6          = 4,
  LSM6DS3_ROUND_XL_SH1_TO_SH6       = 5,
  LSM6DS3_ROUND_GY_XL_SH1_TO_SH12   = 6,
  LSM6DS3_ROUND_GY_XL_SH1_TO_SH6    = 7,
} lsm6ds3_rounding_t;
int32_t lsm6ds3_rounding_mode_set(lsm6ds3_ctx_t *ctx,
                                  lsm6ds3_rounding_t val);
int32_t lsm6ds3_rounding_mode_get(lsm6ds3_ctx_t *ctx,
                                  lsm6ds3_rounding_t *val);

