INSA-GEI/arm-ada/lib/arm/embedded-stm32f746disco-armada/bsp/BSP/Components/lsm6ds3/lsm6ds3_reg.h
typedef enum {
  LSM6DS3_ACTIVE_HIGH = 0,
  LSM6DS3_ACTIVE_LOW  = 1,
} lsm6ds3_pin_pol_t;
int32_t lsm6ds3_pin_polarity_set(lsm6ds3_ctx_t *ctx, lsm6ds3_pin_pol_t val);
int32_t lsm6ds3_pin_polarity_get(lsm6ds3_ctx_t *ctx,  lsm6ds3_pin_pol_t *val);

int32_t lsm6ds3_all_on_int1_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_all_on_int1_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DS3_INT_PULSED  = 0,
  LSM6DS3_INT_LATCHED = 1,
} lsm6ds3_lir_t;
int32_t lsm6ds3_int_notification_set(lsm6ds3_ctx_t *ctx, lsm6ds3_lir_t val);
int32_t lsm6ds3_int_notification_get(lsm6ds3_ctx_t *ctx, lsm6ds3_lir_t *val);

int32_t lsm6ds3_wkup_src_get(lsm6ds3_ctx_t *ctx, lsm6ds3_wake_up_src_t *val);

int32_t lsm6ds3_wkup_threshold_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_wkup_threshold_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_wkup_dur_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_wkup_dur_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_gy_sleep_mode_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_gy_sleep_mode_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_act_mode_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_act_mode_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_act_sleep_dur_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_act_sleep_dur_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_tap_src_get(lsm6ds3_ctx_t *ctx, lsm6ds3_tap_src_t *val);

int32_t lsm6ds3_tap_detection_on_z_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_tap_detection_on_z_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_tap_detection_on_y_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_tap_detection_on_y_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_tap_detection_on_x_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_tap_detection_on_x_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_tap_threshold_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_tap_threshold_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_tap_shock_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_tap_shock_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_tap_quiet_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_tap_quiet_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_tap_dur_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_tap_dur_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DS3_ONLY_DOUBLE = 1,
  LSM6DS3_SINGLE_DOUBLE = 0,
} lsm6ds3_tap_md_t;
int32_t lsm6ds3_tap_mode_set(lsm6ds3_ctx_t *ctx, lsm6ds3_tap_md_t val);
int32_t lsm6ds3_tap_mode_get(lsm6ds3_ctx_t *ctx, lsm6ds3_tap_md_t *val);

typedef enum {
  LSM6DS3_ODR_DIV_2_FEED = 0,
  LSM6DS3_LPF2_FEED = 1,
} lsm6ds3_low_pass_on_6d_t;
int32_t lsm6ds3_6d_feed_data_set(lsm6ds3_ctx_t *ctx,
                                 lsm6ds3_low_pass_on_6d_t val);
int32_t lsm6ds3_6d_feed_data_get(lsm6ds3_ctx_t *ctx,
                                 lsm6ds3_low_pass_on_6d_t *val);

int32_t lsm6ds3_6d_src_get(lsm6ds3_ctx_t *ctx, lsm6ds3_d6d_src_t *val);

typedef enum {
  LSM6DS3_DEG_80 = 0,
  LSM6DS3_DEG_70 = 1,
  LSM6DS3_DEG_60 = 2,
  LSM6DS3_DEG_50 = 3,
} lsm6ds3_sixd_ths_t;
int32_t lsm6ds3_6d_threshold_set(lsm6ds3_ctx_t *ctx, lsm6ds3_sixd_ths_t val);
int32_t lsm6ds3_6d_threshold_get(lsm6ds3_ctx_t *ctx, lsm6ds3_sixd_ths_t *val);

int32_t lsm6ds3_4d_mode_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_4d_mode_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DS3_156_mg = 0,
  LSM6DS3_219_mg = 1,
  LSM6DS3_250_mg = 2,
  LSM6DS3_312_mg = 3,
  LSM6DS3_344_mg = 4,
  LSM6DS3_406_mg = 5,
  LSM6DS3_469_mg = 6,
  LSM6DS3_500_mg = 7,
} lsm6ds3_ff_ths_t;
int32_t lsm6ds3_ff_threshold_set(lsm6ds3_ctx_t *ctx, lsm6ds3_ff_ths_t val);
int32_t lsm6ds3_ff_threshold_get(lsm6ds3_ctx_t *ctx, lsm6ds3_ff_ths_t *val);

int32_t lsm6ds3_ff_dur_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_ff_dur_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_fifo_watermark_set(lsm6ds3_ctx_t *ctx, uint16_t val);
int32_t lsm6ds3_fifo_watermark_get(lsm6ds3_ctx_t *ctx, uint16_t *val);

typedef enum {
  LSM6DS3_TRG_XL_GY_DRDY   = 0,
  LSM6DS3_TRG_STEP_DETECT  = 1,
} lsm6ds3_tmr_ped_fifo_drdy_t;
int32_t lsm6ds3_fifo_write_trigger_set(lsm6ds3_ctx_t *ctx,
                                       lsm6ds3_tmr_ped_fifo_drdy_t val);
int32_t lsm6ds3_fifo_write_trigger_get(lsm6ds3_ctx_t *ctx,
                                       lsm6ds3_tmr_ped_fifo_drdy_t *val);

int32_t lsm6ds3_fifo_pedo_batch_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_fifo_pedo_batch_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DS3_FIFO_XL_DISABLE = 0,
  LSM6DS3_FIFO_XL_NO_DEC  = 1,
  LSM6DS3_FIFO_XL_DEC_2   = 2,
  LSM6DS3_FIFO_XL_DEC_3   = 3,
  LSM6DS3_FIFO_XL_DEC_4   = 4,
  LSM6DS3_FIFO_XL_DEC_8   = 5,
  LSM6DS3_FIFO_XL_DEC_16  = 6,
  LSM6DS3_FIFO_XL_DEC_32  = 7,
} lsm6ds3_dec_fifo_xl_t;
int32_t lsm6ds3_fifo_xl_batch_set(lsm6ds3_ctx_t *ctx,
                                  lsm6ds3_dec_fifo_xl_t val);
int32_t lsm6ds3_fifo_xl_batch_get(lsm6ds3_ctx_t *ctx,
                                  lsm6ds3_dec_fifo_xl_t *val);

typedef enum {
  LSM6DS3_FIFO_GY_DISABLE = 0,
  LSM6DS3_FIFO_GY_NO_DEC  = 1,
  LSM6DS3_FIFO_GY_DEC_2   = 2,
  LSM6DS3_FIFO_GY_DEC_3   = 3,
  LSM6DS3_FIFO_GY_DEC_4   = 4,
  LSM6DS3_FIFO_GY_DEC_8   = 5,
  LSM6DS3_FIFO_GY_DEC_16  = 6,
  LSM6DS3_FIFO_GY_DEC_32  = 7,
} lsm6ds3_dec_fifo_gyro_t;
int32_t lsm6ds3_fifo_gy_batch_set(lsm6ds3_ctx_t *ctx,
                                  lsm6ds3_dec_fifo_gyro_t val);
int32_t lsm6ds3_fifo_gy_batch_get(lsm6ds3_ctx_t *ctx,
                                  lsm6ds3_dec_fifo_gyro_t *val);

typedef enum {
  LSM6DS3_FIFO_DS3_DISABLE = 0,
  LSM6DS3_FIFO_DS3_NO_DEC  = 1,
  LSM6DS3_FIFO_DS3_DEC_2   = 2,
  LSM6DS3_FIFO_DS3_DEC_3   = 3,
  LSM6DS3_FIFO_DS3_DEC_4   = 4,
  LSM6DS3_FIFO_DS3_DEC_8   = 5,
  LSM6DS3_FIFO_DS3_DEC_16  = 6,
  LSM6DS3_FIFO_DS3_DEC_32  = 7,
} lsm6ds3_dec_ds3_fifo_t;
int32_t lsm6ds3_fifo_dataset_3_batch_set(lsm6ds3_ctx_t *ctx,
                                         lsm6ds3_dec_ds3_fifo_t val);
int32_t lsm6ds3_fifo_dataset_3_batch_get(lsm6ds3_ctx_t *ctx,
                                         lsm6ds3_dec_ds3_fifo_t *val);

