INSA-GEI/arm-ada/lib/arm/embedded-stm32f746disco-armada/bsp/BSP/Components/lsm6ds3/lsm6ds3_reg.h
typedef enum {
  LSM6DS3_FIFO_DS4_DISABLE = 0,
  LSM6DS3_FIFO_DS4_NO_DEC  = 1,
  LSM6DS3_FIFO_DS4_DEC_2   = 2,
  LSM6DS3_FIFO_DS4_DEC_3   = 3,
  LSM6DS3_FIFO_DS4_DEC_4   = 4,
  LSM6DS3_FIFO_DS4_DEC_8   = 5,
  LSM6DS3_FIFO_DS4_DEC_16  = 6,
  LSM6DS3_FIFO_DS4_DEC_32  = 7,
} lsm6ds3_dec_ds4_fifo_t;
int32_t lsm6ds3_fifo_dataset_4_batch_set(lsm6ds3_ctx_t *ctx,
                                         lsm6ds3_dec_ds4_fifo_t val);
int32_t lsm6ds3_fifo_dataset_4_batch_get(lsm6ds3_ctx_t *ctx,
                                         lsm6ds3_dec_ds4_fifo_t *val);

int32_t lsm6ds3_fifo_xl_gy_8bit_format_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_fifo_xl_gy_8bit_format_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DS3_BYPASS_MODE            = 0,
  LSM6DS3_FIFO_MODE              = 1,
  LSM6DS3_STREAM_TO_FIFO_MODE    = 3,
  LSM6DS3_BYPASS_TO_STREAM_MODE  = 4,
  LSM6DS3_STREAM_MODE            = 6,
} lsm6ds3_fifo_md_t;
int32_t lsm6ds3_fifo_mode_set(lsm6ds3_ctx_t *ctx, lsm6ds3_fifo_md_t val);
int32_t lsm6ds3_fifo_mode_get(lsm6ds3_ctx_t *ctx, lsm6ds3_fifo_md_t *val);

typedef enum {
  LSM6DS3_FIFO_DISABLE = 0,
  LSM6DS3_FIFO_12Hz5   = 1,
  LSM6DS3_FIFO_26Hz    = 2,
  LSM6DS3_FIFO_52Hz    = 3,
  LSM6DS3_FIFO_104Hz   = 4,
  LSM6DS3_FIFO_208Hz   = 5,
  LSM6DS3_FIFO_416Hz   = 6,
  LSM6DS3_FIFO_833Hz   = 7,
  LSM6DS3_FIFO_1k66Hz  = 8,
  LSM6DS3_FIFO_3k33Hz  = 9,
  LSM6DS3_FIFO_6k66Hz  = 10,
} lsm6ds3_odr_fifo_t;
int32_t lsm6ds3_fifo_data_rate_set(lsm6ds3_ctx_t *ctx,
                                   lsm6ds3_odr_fifo_t val);
int32_t lsm6ds3_fifo_data_rate_get(lsm6ds3_ctx_t *ctx,
                                   lsm6ds3_odr_fifo_t *val);

int32_t lsm6ds3_fifo_stop_on_wtm_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_fifo_stop_on_wtm_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_fifo_temp_batch_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_fifo_temp_batch_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_fifo_data_level_get(lsm6ds3_ctx_t *ctx, uint16_t *val);

int32_t lsm6ds3_fifo_full_flag_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_fifo_ovr_flag_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_fifo_wtm_flag_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_fifo_pattern_get(lsm6ds3_ctx_t *ctx, uint16_t *val);

typedef enum {
  LSM6DS3_DEN_DISABLE    = 0,
  LSM6DS3_LEVEL_FIFO     = 6,
  LSM6DS3_LEVEL_LETCHED  = 3,
  LSM6DS3_LEVEL_TRIGGER  = 2,
  LSM6DS3_EDGE_TRIGGER   = 4,
} lsm6ds3_den_mode_t;
int32_t lsm6ds3_den_mode_set(lsm6ds3_ctx_t *ctx, lsm6ds3_den_mode_t val);
int32_t lsm6ds3_den_mode_get(lsm6ds3_ctx_t *ctx, lsm6ds3_den_mode_t *val);

int32_t lsm6ds3_pedo_step_reset_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_pedo_step_reset_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_pedo_timestamp_raw_get(lsm6ds3_ctx_t *ctx, uint8_t *buff);

int32_t lsm6ds3_pedo_step_detect_flag_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_pedo_sens_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_pedo_sens_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_pedo_threshold_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_pedo_threshold_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DS3_PEDO_AT_2g = 0,
  LSM6DS3_PEDO_AT_4g = 1,
} lsm6ds3_pedo_fs_t;
int32_t lsm6ds3_pedo_full_scale_set(lsm6ds3_ctx_t *ctx,
                                    lsm6ds3_pedo_fs_t val);
int32_t lsm6ds3_pedo_full_scale_get(lsm6ds3_ctx_t *ctx,
                                    lsm6ds3_pedo_fs_t *val);

int32_t lsm6ds3_pedo_debounce_steps_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_pedo_debounce_steps_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_pedo_timeout_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_pedo_timeout_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_motion_sens_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_motion_sens_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_motion_event_flag_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_motion_threshold_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_motion_threshold_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_sc_delta_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_sc_delta_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_tilt_event_flag_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_tilt_sens_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_tilt_sens_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_mag_soft_iron_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_mag_soft_iron_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_mag_hard_iron_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_mag_hard_iron_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_mag_soft_iron_end_op_flag_get(lsm6ds3_ctx_t *ctx,
                                              uint8_t *val);

int32_t lsm6ds3_mag_soft_iron_coeff_set(lsm6ds3_ctx_t *ctx, uint8_t *buff);
int32_t lsm6ds3_mag_soft_iron_coeff_get(lsm6ds3_ctx_t *ctx, uint8_t *buff);

int32_t lsm6ds3_mag_offset_set(lsm6ds3_ctx_t *ctx, uint8_t *buff);
int32_t lsm6ds3_mag_offset_get(lsm6ds3_ctx_t *ctx, uint8_t *buff);

int32_t lsm6ds3_sh_sync_sens_frame_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_sh_sync_sens_frame_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_sh_master_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_sh_master_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_sh_pass_through_set(lsm6ds3_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_sh_pass_through_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DS3_EXT_PULL_UP      = 0,
  LSM6DS3_INTERNAL_PULL_UP = 1,
} lsm6ds3_sh_pin_md_t;
int32_t lsm6ds3_sh_pin_mode_set(lsm6ds3_ctx_t *ctx, lsm6ds3_sh_pin_md_t val);
int32_t lsm6ds3_sh_pin_mode_get(lsm6ds3_ctx_t *ctx, lsm6ds3_sh_pin_md_t *val);

typedef enum {
  LSM6DS3_XL_GY_DRDY      = 0,
  LSM6DS3_EXT_ON_INT2_PIN = 1,
} lsm6ds3_start_cfg_t;
int32_t lsm6ds3_sh_syncro_mode_set(lsm6ds3_ctx_t *ctx,
                                   lsm6ds3_start_cfg_t val);
int32_t lsm6ds3_sh_syncro_mode_get(lsm6ds3_ctx_t *ctx,
                                   lsm6ds3_start_cfg_t *val);

