INSA-GEI/arm-ada/lib/arm/embedded-stm32f746disco-armada/bsp/BSP/Components/lsm6ds3/lsm6ds3_reg.h
typedef struct {
    lsm6ds3_sensorhub1_reg_t   sh_byte_1;
    lsm6ds3_sensorhub2_reg_t   sh_byte_2;
    lsm6ds3_sensorhub3_reg_t   sh_byte_3;
    lsm6ds3_sensorhub4_reg_t   sh_byte_4;
    lsm6ds3_sensorhub5_reg_t   sh_byte_5;
    lsm6ds3_sensorhub6_reg_t   sh_byte_6;
    lsm6ds3_sensorhub7_reg_t   sh_byte_7;
    lsm6ds3_sensorhub8_reg_t   sh_byte_8;
    lsm6ds3_sensorhub9_reg_t   sh_byte_9;
    lsm6ds3_sensorhub10_reg_t  sh_byte_10;
    lsm6ds3_sensorhub11_reg_t  sh_byte_11;
    lsm6ds3_sensorhub12_reg_t  sh_byte_12;
    lsm6ds3_sensorhub13_reg_t  sh_byte_13;
    lsm6ds3_sensorhub14_reg_t  sh_byte_14;
    lsm6ds3_sensorhub15_reg_t  sh_byte_15;
    lsm6ds3_sensorhub16_reg_t  sh_byte_16;
    lsm6ds3_sensorhub17_reg_t  sh_byte_17;
    lsm6ds3_sensorhub18_reg_t  sh_byte_18;
} lsm6ds3_sh_read_t;
int32_t lsm6ds3_sh_read_data_raw_get(lsm6ds3_ctx_t *ctx,
                                     lsm6ds3_sh_read_t *buff);

typedef enum {
  LSM6DS3_SLV_0        = 0,
  LSM6DS3_SLV_0_1      = 1,
  LSM6DS3_SLV_0_1_2    = 2,
  LSM6DS3_SLV_0_1_2_3  = 3,
} lsm6ds3_aux_sens_on_t;
int32_t lsm6ds3_sh_num_of_dev_connected_set(lsm6ds3_ctx_t *ctx,
                                            lsm6ds3_aux_sens_on_t val);
int32_t lsm6ds3_sh_num_of_dev_connected_get(lsm6ds3_ctx_t *ctx,
                                            lsm6ds3_aux_sens_on_t *val);

typedef struct{
  uint8_t   slv0_add;
  uint8_t   slv0_subadd;
  uint8_t   slv0_data;
} lsm6ds3_sh_cfg_write_t;
int32_t lsm6ds3_sh_cfg_write(lsm6ds3_ctx_t *ctx, lsm6ds3_sh_cfg_write_t *val);

typedef struct{
  uint8_t   slv_add;
  uint8_t   slv_subadd;
  uint8_t   slv_len;
} lsm6ds3_sh_cfg_read_t;
int32_t lsm6ds3_sh_slv0_cfg_read(lsm6ds3_ctx_t *ctx,
                                 lsm6ds3_sh_cfg_read_t *val);
int32_t lsm6ds3_sh_slv1_cfg_read(lsm6ds3_ctx_t *ctx,
                                 lsm6ds3_sh_cfg_read_t *val);
int32_t lsm6ds3_sh_slv2_cfg_read(lsm6ds3_ctx_t *ctx,
                                 lsm6ds3_sh_cfg_read_t *val);
int32_t lsm6ds3_sh_slv3_cfg_read(lsm6ds3_ctx_t *ctx,
                                 lsm6ds3_sh_cfg_read_t *val);

int32_t lsm6ds3_sh_end_op_flag_get(lsm6ds3_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DS3_USE_SLOPE = 0,
  LSM6DS3_USE_HPF   = 1,
} lsm6ds3_slope_fds_t;
int32_t lsm6ds3_xl_hp_path_internal_set(lsm6ds3_ctx_t *ctx,
                                        lsm6ds3_slope_fds_t val);
int32_t lsm6ds3_xl_hp_path_internal_get(lsm6ds3_ctx_t *ctx,
                                        lsm6ds3_slope_fds_t *val);

/**
  *@}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* LSM6DS3_REGS_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
